# Training files
We are going to use several columns to predict Price Charged.

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import os
from pathlib import Path

In [3]:
df = pd.read_csv("Cab_Data.csv")
df.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [4]:
df = df[["Date of Travel", "Company", "City", "KM Travelled", "Price Charged"]]
df.head()

   Date of Travel   Company        City  KM Travelled  Price Charged
0           42377  Pink Cab  ATLANTA GA         30.45         370.95
1           42375  Pink Cab  ATLANTA GA         28.62         358.52
2           42371  Pink Cab  ATLANTA GA          9.04         125.20
3           42376  Pink Cab  ATLANTA GA         33.17         377.40
4           42372  Pink Cab  ATLANTA GA          8.73         114.62

In [6]:
df.columns = ["Date_of_Travel", "Company", "City", "KM_Travelled", "Price_Charged"]
df.head()

   Date_of_Travel   Company        City  KM_Travelled  Price_Charged
0           42377  Pink Cab  ATLANTA GA         30.45         370.95
1           42375  Pink Cab  ATLANTA GA         28.62         358.52
2           42371  Pink Cab  ATLANTA GA          9.04         125.20
3           42376  Pink Cab  ATLANTA GA         33.17         377.40
4           42372  Pink Cab  ATLANTA GA          8.73         114.62

There are some caveats to mention. `Date_of_Travel` wouldn't be the best way to handle in this format. However, we are going to keep it this format since the deployment is the important ones and training it isn't that important here. Alternatively we could just ignore it all. 

For categorical variables like `Company` and `City`, we are going to categorify them. WE are not going to use one-hot encoding though, but just assign them to numerical values (or even not since we are planning to use Random Forest or Decision Tree) might be sufficient. 

We shall leave `KM_Travelled` as it is.

In [7]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.tree import DecisionTreeRegressor
from IPython.display import Image, display_svg, SVG

In [8]:
path = Path(".")